#include "hyp2gdos.h"

struct printinfo {
	/*  0 */ struct vdi *vdi;
	/*  4 */ GRECT text_area;
	/* 12 */ short cell_width;
	/* 14 */ short line_height;
	/* 16 */ struct layout *layout;
	/* 20 */ struct fontinfo *fonts;
};

struct x40 {
	/*  0 */ GRECT pagearea;
	/*  8 */ GRECT outputarea;
	/* 16 */ _WORD border_left;
	/* 18 */ _WORD border_top;
	/* 20 */ _WORD border_right;
	/* 22 */ _WORD border_bottom;
	/* 24 */ GRECT border_area;
	/* 32 */ GRECT text_area;
};

void x13332(struct printinfo *printinfo);
void x136da(struct pageinfo *page, struct printinfo *printinfo, long y, long x, _WORD *x1);
char *print_link(struct hypfile *hyp, struct printinfo *printinfo, _WORD *x, _WORD *y, char *text, short *column);
void x132c8(struct vdi *vdi, _WORD x, _WORD x1, _WORD x2);


#ifdef __GNUC__
void x13332(struct printinfo *printinfo)
{
	printinfo->line_height = 0;
	printinfo->cell_width = 0;
}
void x136da(struct pageinfo *page, struct printinfo *printinfo, long y, long x, _WORD *x1)
{
	(void) printinfo;
	(void) page;
	(void) x;
	(void) y;
	*x1 = 0;
}
#endif

static char udodatabase[LINEMAX];
static char udotitle[LINEMAX];

/**************************************************************************/
/* ---------------------------------------------------------------------- */
/**************************************************************************/

static void print_line(struct printinfo *printinfo, struct pageinfo *page, long lineno, _WORD x, _WORD y)
{
	struct fontinfo *fonts;
	struct vdi *vdi;
	_WORD d3;
	_WORD effects;
	_WORD fontid;
	char *text;
	short column;
	char *start;
	
	fonts = printinfo->fonts;
	vdi = printinfo->vdi;
	d3 = x;
	effects = 0;
	if (page->hyp->header.magic == HYP_MAGIC_HYP || fonts->use_standard)
		fontid = fonts->standard_font_id;
	else
		fontid = fonts->typewriter_font_id;
	vdi_text_attributes(vdi, fonts->text_color, -1, effects, fontid);
	text = page->text[lineno];
	column = 0;
	while (*text)
	{
		if (*text != HYP_ESC)
		{
			start = text;
			if (fonts->expand_spaces)
			{
				if (*text == '\t')
				{
					text++;
					column = ((column + fonts->tabsize) / fonts->tabsize) * fonts->tabsize;
					goto x13870;
				} else
				{
					if (*text++ == ' ' && *text == ' ')
					{
						short x2;
						
						do
							text++;
						while (*text == ' ');
						column += text - start;
				x13870:
						x2 = printinfo->cell_width * column + d3;
						if (effects != 0)
							x132c8(vdi, y, x, x2);
						x = x2;
					} else
					{
						for (;;)
						{
							switch (*text)
							{
							case HYP_EOL:
							case HYP_ESC:
							case '\t':
								goto printout;
							case ' ':
								if (text[1] == ' ')
									goto printout;
								text++;
								break;
							default:
								text++;
								break;
							}
						}
					}
				}
			} else
			{
				_WORD len;
				
				/* 138be */
				text++;
				while (*text != HYP_EOL && *text != HYP_ESC)
					text++;
				/* 138ca */
			printout:
				len = (_WORD)(text - start);
				vdi_draw_text(vdi, x, y, start, len);
				x += vdi_get_textwidth(vdi, start, len);
				column += len;
			}
		} else
		{
			if (page->hyp->header.magic != HYP_MAGIC_HYP)
			{
				vdi_draw_text(vdi, x, y, text, 1);
				x += vdi_get_textwidth(vdi, text, 1);
				text++;
				column += 1;
			} else
			{
				text++;
				switch (*text)
				{
				case HYP_ESC_ESC:
					vdi_draw_text(vdi, x, y, text, 1);
					x += vdi_get_textwidth(vdi, text, 1);
					text++;
					column += 1;
					break;
				
				case HYP_ESC_LINK:
				case HYP_ESC_ALINK:
					text = print_link(page->hyp, printinfo, &x, &y, text + 1, &column);
					vdi_text_attributes(vdi, fonts->text_color, -1, effects, fontid);
					break;

				case HYP_ESC_LINK_LINE:
				case HYP_ESC_ALINK_LINE:
					text = print_link(page->hyp, printinfo, &x, &y, text + 3, &column);
					vdi_text_attributes(vdi, fonts->text_color, -1, effects, fontid);
					break;
				
				default:
					/*
					 * BUG: should check for upper limit, too.
					 */
					if ((unsigned char) *text >= HYP_ESC_TEXTATTR_FIRST)
					{
						effects = (unsigned char) *text - HYP_ESC_TEXTATTR_FIRST;
						if (effects & 0x40)
							fontid = fonts->typewriter_font_id;
						else
							fontid = fonts->standard_font_id;
						vdi_text_attributes(vdi, fonts->text_color, -1, effects, fontid);
					}
					text++;
					break;
				}
			}
		}
	}
	
	vdi_text_attributes(vdi, -1, -1, 0, page->hyp->header.magic == HYP_MAGIC_HYP || fonts->use_standard ? fonts->standard_font_id : fonts->typewriter_font_id);
}

/* ---------------------------------------------------------------------- */

static long calc_text_height(struct printinfo *printinfo, struct pageinfo *page, long lineno, long column, long height)
{
	char *data;
	char *end; /* 16 */
	short picnode; /* 14 */
	short y_offset; /* 12 */
	short x_offset; /* 10 */
	short char_width; /* 8 */
	short char_height; /* 6 */
	short attributes;
	long y; /* 0 */
	long pixwidth;
	long pixheight;
	long w;
	struct node *pic;
	char *picdata;
	
	data = page->node->data;
	end = data + page->node->datalen;
	if (page->hyp->header.magic == HYP_MAGIC_HYP)
	{
		while (data < end && *data == HYP_ESC)
		{
			switch (data[1])
			{
			case HYP_ESC_PIC:
				dec_255_decode(data + 2, &picnode);
				pic = page->node->picdata;
				while (pic && pic->nodenr != picnode)
					pic = pic->picdata;
				if (pic == NULL)
				{
					char_width = 1;
					char_height = 1;
					if (page->hyp->flags & SCALE_IMAGES)
					{
						pixwidth = char_width * printinfo->cell_width;
						pixheight = char_height * printinfo->line_height;
					} else
					{
						pixwidth = char_width * HYP_PIC_FONTW;
						pixheight = char_height * HYP_PIC_FONTH;
					}
				} else
				{
					picdata = pic->data;
